scripts/sabotages/107-t79-macro-reads-org-scope-drop.patch
# SABOTAGE: T79 (spec §I6 macros composer palette + CSAT loop closed) — drops the
# `scope: scope` org-scope threading from `Samen.Web.Support.Reads.macros/2` (the
# composer palette's read), replacing it with `authorize?: false` (a raw, unscoped
# bulk read). Without `Samen.Policy.OrgScope` in effect, `macros/2` returns EVERY
# org's enabled macros regardless of which org's scope is passed — a direct
# cross-tenant leak of canned-response templates into another org's composer
# palette. The `drop-the-filter-must-flip-a-named-test` org-scope pin.
# APP: samen_web
# TEST_FILES: test/samen/web/support_macro_composer_test.exs
# MUST_FAIL: a two-org pin: org B never sees org A's macros
# APPLY: patch -p1 --no-backup-if-mismatch < scripts/sabotages/107-t79-macro-reads-org-scope-drop.patch
diff --git a/samen_web/lib/samen/web/support/reads.ex b/samen_web/lib/samen/web/support/reads.ex
index 904b1fd..fc4c001 100644
--- a/samen_web/lib/samen/web/support/reads.ex
+++ b/samen_web/lib/samen/web/support/reads.ex
@@ -235,13 +235,13 @@
   rows, sorted by name. Honest empty (`[]`) when the org has none — never
   fabricated.
   """
-  def macros(mount, scope) do
+  def macros(mount, _scope) do
     Mount.resource(mount, Macro)
     |> Ash.Query.filter(enabled == true)
     |> Ash.Query.ensure_selected([:name, :description, :body_template, :tags, :category])
     |> Ash.Query.sort(name: :asc)
     |> Ash.Query.limit(@detail_limit)
-    |> Ash.read!(scope: scope)
+    |> Ash.read!(authorize?: false)
   rescue
     _ -> []
   end
