scripts/sabotages/119-t83-j3-fleet-resolution-shape-validation-drop.patch
# SABOTAGE: T83 J3/Amendment 1 (ADR-044 §16.2). Samen.Fleet.Resolution.validate_scope/1
# must fail CLOSED to :none for any value outside the closed shape. Making the fallback a
# pass-through leaks an unvalidated resolver return (garbage/nil/list) into the resolution
# path instead of masking — the opposite of mask-by-omission.
# APP: samen_core
# TEST_FILES: test/fleet/resolution_test.exs
# MUST_FAIL: an unrecognized tuple
diff --git a/samen_core/lib/samen/fleet/resolution.ex b/samen_core/lib/samen/fleet/resolution.ex
--- a/samen_core/lib/samen/fleet/resolution.ex
+++ b/samen_core/lib/samen/fleet/resolution.ex
@@ -79,5 +79,5 @@
     if Enum.all?(set, &is_binary/1), do: {:accounts, set}, else: :none
   end
 
-  def validate_scope(_), do: :none
+  def validate_scope(other), do: other
 end
