scripts/sabotages/120-t83-j3-mount-fleet-label-whitelist-drop.patch
# SABOTAGE: T83 J3 (ADR-044 §6.3a #2). The closed @label_keys whitelist in Samen.Web.Mount
# must carry the fleet seams — dropping fleet_authority/fleet_resolution makes a cockpit
# mount's fleet label silently vanish at from_session/1 (the quiet-nil landmine: fail-open-
# looking, not loud), so the gate reads nil.
# APP: samen_web
# TEST_FILES: test/samen/web/mount_fleet_label_test.exs
# MUST_FAIL: both fleet label keys are in the closed whitelist
diff --git a/samen_web/lib/samen/web/mount.ex b/samen_web/lib/samen/web/mount.ex
--- a/samen_web/lib/samen/web/mount.ex
+++ b/samen_web/lib/samen/web/mount.ex
@@ -193,7 +193,6 @@
     operator_org_id operator_title operator_workspace operator_glyph
     operator_initials operator_logo_style operator_role operator_user
     operator_authority
-    fleet_authority fleet_resolution
     aggregate_loader otp_app status
     user_name user_role user_initials
     chat_path pubsub presence object_cards
