scripts/sabotages/144-t155-driftwood-ai-support-reply-kind-unregistered.patch
# SABOTAGE: T155 (driftwood draft-persistence-through-approval — the host adoption is load-bearing) — removes the ai_support_reply approval-kind registration from driftwood's config, so the AI support-reply draft can no longer route through the E3 approval engine end-to-end in the real host. Proves the driftwood adoption wiring is genuinely required (not decorative): drop it and the persistence-through-approval proof fails. Reverts byte-exact.
# APP: driftwood
# TEST_FILES: test/ai_support_draft_persistence_test.exs
# MUST_FAIL: a draft PERSISTS in Driftwood.Repo and opens a pending ai_support_reply approval
diff --git a/driftwood/config/config.exs b/driftwood/config/config.exs
--- a/driftwood/config/config.exs
+++ b/driftwood/config/config.exs
@@ -284,9 +284,6 @@ config :samen_core, Samen.Approvals,
 config :samen_core, Samen.Approvals.Registry,
   kinds: %{
     "pii_reveal" => {:operator, Samen.Reveal.ApprovalHandler},
-    # T155 (ADR-043 §6.3 D5): the AI support operator's human-gated send. Operator plane;
-    # requester (the AI service principal) is never the decider (distinct-party by construction).
-    "ai_support_reply" => {:operator, Samen.AI.SupportOperator.ReplyHandler},
     # ADR-047 A4/A6 (§9#1 TAKEN, ADR-043 §6.2 unamended): the ONE agent-write kind. An
     # `effect: :write` agent tool NEVER executes in the turn — it opens this E3 Face-1
     # approval (requester = the AI service principal, which the distinct-party CHECK bars
