scripts/sabotages/19-f3-retention-does-not-fire.patch
# SABOTAGE: F3.2 gate sabotage — the retention sweep REPORTS rows as swept but
# never actually deletes them (`Samen.Retention` :delete arm drops the
# `Ash.destroy!` call). Retention claims success while an over-TTL row survives —
# the exact "fake ok" the fail-honest contract forbids. The retention red-path MUST
# fail (an over-TTL row must be gone; a fresher row retained).
# APP: samen_core
# TEST_FILES: test/retention_sweep_test.exs
# MUST_FAIL: a row OLDER than the TTL is swept; a fresher row is RETAINED (positive control)
diff --git a/samen_core/lib/samen/retention.ex b/samen_core/lib/samen/retention.ex
--- a/samen_core/lib/samen/retention.ex
+++ b/samen_core/lib/samen/retention.ex
@@ -244,7 +244,6 @@ defmodule Samen.Retention do
       destroy_opts = terminal_destroy_opts(spec.resource)
 
-      Enum.reduce(expired, 0, fn row, acc ->
-        Ash.destroy!(row, destroy_opts)
+      Enum.reduce(expired, 0, fn _row, acc ->
         acc + 1
       end)
     end
