scripts/sabotages/143-t155-ai-crm-preview-org-scope-drop.patch
# SABOTAGE: T155 (org-scope on the kit's new reads) — drops the org_id conjunct from Samen.Web.AI.Server.crm_preview/4's grounding read, so a caller can render ANOTHER org's CRM record on the AI grounding surface (cross-org leak). The drop-filter-flips-a-named-test discipline for the CRM preview read. Reverts byte-exact.
# APP: samen_web
# TEST_FILES: test/samen/web/ai/ai_kit_test.exs
# MUST_FAIL: crm_preview is org-scoped: another org's record is not found
diff --git a/samen_web/lib/samen/web/ai/server.ex b/samen_web/lib/samen/web/ai/server.ex
index 9899b00..fda2d4c 100644
--- a/samen_web/lib/samen/web/ai/server.ex
+++ b/samen_web/lib/samen/web/ai/server.ex
@@ -139,7 +139,7 @@ defmodule Samen.Web.AI.Server do
   def crm_preview(mount, org_id, resource, id) do
     query =
       resource
-      |> Ash.Query.filter(org_id == ^org_id and id == ^id)
+      |> Ash.Query.filter(id == ^id)
       |> ensure_public_selected(resource)
 
     case Ash.read(query, authorize?: false) do
