scripts/sabotages/146-t157-pawchart-operator-role-real-roster-collapsed-to-dev-grant.patch
# SABOTAGE: T157 (pawchart operator-role REAL-ROSTER gate) — collapses PawChart.Auth.operator_role/2's armed-prod deny into an unconditional :operator_admin grant, so a principal ABSENT from the operator roster is admitted even when auth_required? is true (the dev fallback should be OFF). This is the exact 'dev fallback instead of a real roster' regression T157 forbids. Reverts byte-exact.
# APP: pawchart
# TEST_FILES: test/operator_authz_test.exs
# MUST_FAIL: armed prod: a roster principal → its role; an absent principal → nil (refused)
diff --git a/pawchart/lib/pawchart/auth.ex b/pawchart/lib/pawchart/auth.ex
index 4a47585..5afccf6 100644
--- a/pawchart/lib/pawchart/auth.ex
+++ b/pawchart/lib/pawchart/auth.ex
@@ -44,7 +44,7 @@ defmodule PawChart.Auth do
 
         _ ->
           # Dev/test convenience ONLY (unmistakably gated on the prod-arming flag being off).
-          if Application.get_env(:pawchart, :auth_required?, false), do: nil, else: :operator_admin
+          :operator_admin
       end
     end
   end
