scripts/sabotages/147-t142-pawchart-mcp-forged-credential-rejection.patch
# SABOTAGE: T142/T157 (pawchart MCP forged-credential REJECTION) — replaces the lookup-miss branch of PawChartWeb.Api.McpKeyResolver.resolve_scope/1 ("no key row matches this token's digest -> :error") with a fabricated {:ok, %Samen.Scope{}}. A FORGED / unknown / revoked bearer token then AUTHENTICATES (200) instead of being rejected (401) — the exact unauthenticated-MCP hole T142 forbids. HONEST DISCLOSURE (T84a P9 lesson): the pure constant-time TIMING property is not independently refutable in this harness; this patch pins the REFUTABLE forged-credential REJECTION (the digest-miss deny is the enforcing layer). Reverts byte-exact.
# APP: pawchart
# TEST_FILES: test/mcp_auth_test.exs
# MUST_FAIL: a FORGED bearer token ⇒ 401 (the enforcing digest lookup rejects it)
diff --git a/pawchart/lib/pawchart_web/api/mcp_key_resolver.ex b/pawchart/lib/pawchart_web/api/mcp_key_resolver.ex
index 8137e39..a70e3eb 100644
--- a/pawchart/lib/pawchart_web/api/mcp_key_resolver.ex
+++ b/pawchart/lib/pawchart_web/api/mcp_key_resolver.ex
@@ -51,7 +51,7 @@ defmodule PawChartWeb.Api.McpKeyResolver do
         end
 
       :error ->
-        :error
+        {:ok, %Samen.Scope{actor: %{id: "forged", org_id: "00000000-0000-4000-8000-000000000000", role: :member, plane: :tenant}}}
     end
   end
 
