scripts/sabotages/243-a2-agent-watchdog-never-nil-dropped.patch
# SABOTAGE: A2 (ADR-047 §4.1) gate sabotage — the never-nil next_turn_at watchdog dropped.
# A run is created :queued with next_turn_at NIL (a lost launch enqueue becomes a
# PERMANENT silent stall: the :agent_turn_due due-scan `where` clause requires
# `not is_nil(next_turn_at)`, so a nil cursor is unselectable forever), and the per-turn
# advance clears the in-flight window mid-run (the same stall for a worker death between
# batches). This is the Samen.Sequences MED-2 invariant — "next_send_at is NEVER nil while
# in flight" — reversed on the agent path. Flips the named watchdog tests (the ARMED
# cursor at start, the non-nil re-arm at the batch boundary, the never-nil invariant
# sweep); the terminal-clears-it half stays green — proving the reds fail because the
# arming is gone, not because the loop died.
# (RE-ANCHORED at A4: the create_run! context moved when the hardcoded `depth: 0, chain:
# []` became the resolved loop provenance. The sabotage's removed/added lines and the
# guarantee it defeats are unchanged.)
# (RE-ANCHORED at T222: both hunks drifted. The per-turn advance now writes
# `encode_transcript_finalizing/3` (UXD-18 checkpoint 2) and the create_run! map gained the
# UXD-08 `hooks:` attribute, so the old context lines no longer matched anywhere. Same two
# removed arming sites, same three MUST_FAIL targets, re-verified flip + byte-exact restore.)
# APP: samen_core
# TEST_FILES: test/ai/agent_durability_test.exs
# MUST_FAIL: ARMED watchdog and a token-only TurnWorker job
# MUST_FAIL: re-arms with a non-nil watchdog
# MUST_FAIL: never-nil invariant holds at every non-terminal point
diff --git a/samen_core/lib/samen/ai/agent.ex b/samen_core/lib/samen/ai/agent.ex
index 206cb66..30f5a05 100644
--- a/samen_core/lib/samen/ai/agent.ex
+++ b/samen_core/lib/samen/ai/agent.ex
@@ -1801,7 +1801,7 @@ defmodule Samen.AI.Agent do
           run
           |> Ash.Changeset.for_update(:advance, %{
             current_turn: turn_index,
-            next_turn_at: DateTime.add(DateTime.utc_now(), @inflight_watchdog_seconds),
+            next_turn_at: nil,
             transcript: encode_transcript_finalizing(run, goal, lines ++ [completion.text]),
             input_tokens_used: run.input_tokens_used + in_tokens,
             output_tokens_used: run.output_tokens_used + out_tokens
@@ -3401,8 +3401,12 @@ defmodule Samen.AI.Agent do
             # durability path for this. Shared by run/4 AND start/4 (both funnel through
             # this one function), so both modes now agree on what they persisted.
             hooks: opts |> Keyword.get(:hooks) |> List.wrap() |> Enum.map(&Atom.to_string/1),
-            transcript: encode_transcript(nil, goal, []),
-            next_turn_at: DateTime.add(DateTime.utc_now(), @inflight_watchdog_seconds)
+            # SABOTAGE (A2, §4.1): the never-nil watchdog is DROPPED — a :queued run is
+            # created with next_turn_at nil (unselectable by the due-scan `where`
+            # clause: a lost launch enqueue is a PERMANENT silent stall), and the
+            # per-turn advance above clears it in flight (same stall, mid-run). The
+            # Samen.Sequences MED-2 invariant, reversed.
+            transcript: encode_transcript(nil, goal, [])
           },
           Map.new(budgets)
         )
