scripts/sabotages/168-t85-i2-sequences-blocked-step-faked-delivered.patch
# SABOTAGE: T85/I2 (phase6 T85 gate M5) — the Sequences surface's honesty chokepoint
# LIES about a keyless step: `Samen.Web.CRM.SequencesLive.step_status_label/1` renders a
# `:blocked` StepSend (no ESP adapter wired — the step genuinely did NOT send, Invariant
# D1) as "Delivered" instead of the honest "Blocked — no sender configured". A tenant
# would read a fabricated delivery for mail that never left the building — the exact
# fail-honest violation the send seam exists to prevent. The named honesty tests flip
# (the per-row render assert AND the unit-pin over every non-delivered status); the
# genuine-:delivered positive control still passes, so the flip is non-vacuous. Reverts
# byte-exact.
# APP: samen_web
# TEST_FILES: test/samen/web/crm_sequences_test.exs
# MUST_FAIL: a BLOCKED step renders 'Blocked', never 'Delivered' or 'Sent'
# MUST_FAIL: the honest status labels never fabricate a delivery for a non-delivered outcome
diff --git a/samen_web/lib/samen/web/crm/sequences_live.ex b/samen_web/lib/samen/web/crm/sequences_live.ex
--- a/samen_web/lib/samen/web/crm/sequences_live.ex
+++ b/samen_web/lib/samen/web/crm/sequences_live.ex
@@ -346,7 +346,7 @@ defmodule Samen.Web.CRM.SequencesLive do
   @doc false
   def step_status_label(:delivered), do: "Delivered"
   def step_status_label(:queued), do: "Queued"
-  def step_status_label(:blocked), do: "Blocked — no sender configured"
+  def step_status_label(:blocked), do: "Delivered"
   def step_status_label(:suppressed), do: "Suppressed"
   def step_status_label(:failed), do: "Failed"
   def step_status_label(:skipped), do: "Skipped"
