scripts/sabotages/25-f7-lifecycle-delivery-fail-honest.patch
# SABOTAGE: F7 G11 gate — the fail-honest lifecycle-email delivery boundary (RP-D1).
# The lifecycle EmailWorker's `decide/3` now DELEGATES to the single delivery
# chokepoint (`Samen.Delivery.Chokepoint.decide/3`, ADR-038 §4.3/T28), so the D1
# fail-honest decision this sabotage defeats now lives there. Makes that decision
# fall an UNCONFIGURED adapter in a non-:test env back to the LocalSink and fake a
# "sent" lifecycle email it never dispatched — the exact Invariant D1 lie the
# fail-honest adapter contract (ADR-014) abolishes, carried to the transactional
# lifecycle-email path (EmailWorker.decide/3 -> Chokepoint.decide/3).
# APP: samen_core
# TEST_FILES: test/delivery_lifecycle_test.exs
# MUST_FAIL: RP-D1: nil adapter in a non-:test env is BLOCKED, never sent
# MUST_FAIL: no branch routes an unconfigured adapter to :deliver in any non-test env
# MUST_FAIL: LocalSink is NEVER the fallback in a non-:test env
# MUST_FAIL: RP-D1 (integration): NO adapter at all in non-:test env → blocked, not :ok
diff --git a/samen_core/lib/samen/delivery/chokepoint.ex b/samen_core/lib/samen/delivery/chokepoint.ex
--- a/samen_core/lib/samen/delivery/chokepoint.ex
+++ b/samen_core/lib/samen/delivery/chokepoint.ex
@@ -77,7 +77,7 @@
   @spec decide(module() | nil, map(), atom()) ::
           {:blocked, :adapter_unconfigured} | {:deliver, module(), map()}
   def decide(nil, _config, :test), do: {:deliver, Samen.Delivery.LocalSink, %{}}
-  def decide(nil, _config, _env), do: {:blocked, :adapter_unconfigured}
+  def decide(nil, _config, _env), do: {:deliver, Samen.Delivery.LocalSink, %{}}
 
   def decide(adapter, config, _env) when is_atom(adapter) do
     if adapter.configured?(config) do
