scripts/sabotages/17-f2-authn-actor-gate-bypass.patch
# SABOTAGE: F2 gate sabotage — the launch AUTH actor-derivation gate (ADR-031). Defeats BOTH
# layers of the tenant prod-path gate so an authenticated session is no longer required:
#   (1) flips `Samen.Web.CurrentOrg`'s `authn_required?/1` OFF for the `{:app_env, …}` opt-in, and
#   (2) forces `param_trust_disarmed?/1` to report the (armed) host as disarmed — the PP-1/PP-3
#       fail-closed default that otherwise still denies an unauthenticated `?org=` on an armed host.
# With both defeated, a tenant mount that requested `authn` (driftwood's prod path) again resolves
# the current org from the query-param convenience identity — deriving a tenant actor with NO
# authenticated session (the exact launch hole F2 closes). The prod-path RED tests MUST fail with
# it — proving BOTH the authn opt-in AND the armed-host fail-closed default are load-bearing.
# APP: driftwood
# TEST_FILES: test/auth_prodpath_test.exs
# MUST_FAIL: prod-path RED: an unauthenticated request derives NO actor
# MUST_FAIL: prod-path RED: an authenticated user cannot act on a non-member org
diff --git a/samen_web/lib/samen/web/current_org.ex b/samen_web/lib/samen/web/current_org.ex
index 347e803..c972456 100644
--- a/samen_web/lib/samen/web/current_org.ex
+++ b/samen_web/lib/samen/web/current_org.ex
@@ -141,7 +141,10 @@ defmodule Samen.Web.CurrentOrg do
         true
 
       {:app_env, app, key} when is_atom(app) and is_atom(key) ->
-        !!Application.get_env(app, key, false)
+        # SABOTAGE (17-f2): the authn gate is forced OFF regardless of the runtime flag, so a
+        # tenant mount that opted into `authn` still trusts the query-param identity — the prod
+        # actor is derived with NO authenticated session (the exact launch hole F2 closes).
+        false && !!Application.get_env(app, key, false)
 
       _ ->
         false
@@ -164,7 +167,7 @@ defmodule Samen.Web.CurrentOrg do
   defp param_trust_disarmed?(mount) do
     case Samen.Web.Operator.otp_app(mount) do
       nil -> true
-      otp_app -> not Application.get_env(otp_app, :auth_required?, false)
+      _otp_app -> true
     end
   end
 
