scripts/sabotages/20-f3-dsar-plane-bypass.patch
# SABOTAGE: F3.3 gate sabotage — the DSAR two-plane split. `Samen.Dsar` masks NOTHING
# on the operator plane (`masked?(:operator, ...)` → false), so an operator export
# WITHOUT a reveal grant dumps the subject's plaintext across the plane boundary — the
# exact cross-plane leak the bundle must never produce. The plane red-path MUST fail.
# APP: samen_core
# TEST_FILES: test/dsar_export_test.exs
# MUST_FAIL: every value is •••• — NEVER plaintext, NEVER a token/ciphertext in the bundle
diff --git a/samen_core/lib/samen/dsar.ex b/samen_core/lib/samen/dsar.ex
--- a/samen_core/lib/samen/dsar.ex
+++ b/samen_core/lib/samen/dsar.ex
@@ -149,7 +149,7 @@
   # grant, no actor — masks (fail-closed). The default plane is :operator, so an export with no
   # explicit authorization masks: never plaintext-by-default.
   defp masked?(:tenant, _subject_id, _actor, _opts), do: false
-  defp masked?(:operator, subject_id, actor, opts), do: not real_grant?(subject_id, actor, opts)
+  defp masked?(:operator, _subject_id, _actor, _opts), do: false
   defp masked?(_plane, _subject_id, _actor, _opts), do: true
 
   # Consult the REAL reveal grant model — NEVER a caller-asserted boolean. Requires a LITERAL
