scripts/sabotages/308-t217-c1i2c-park-folds-content-canary.patch
# SABOTAGE: ADR-048 §4 (T217) — coverage-truth SECOND PASS
# (nodes/C1V/work/seats/coverage-truth-2.verdict.md, mutation #6) proved that
# `encode_transcript/3` — used ONLY by the park/pending-approval path — performs its own
# `"folds" => []` write, a SEPARATE call site from `encode_transcript/2`'s identical write
# (sabotage 305). Corrupting THIS call site alone left all 7 then-existing tests, including
# 305's own new assertion, passing silently: nothing in the repo drove a write tool call
# through a real proposal to exercise the park path's own folds write. This mutation
# corrupts ONLY the 3-arity function body; the 2-arity path is untouched.
# APP: samen_core
# TEST_FILES: test/ai/agent_dual_view_test.exs
# MUST_FAIL: PARK FOLDS CONTENT: the park path's folds ledger equals the empty ledger, not merely present
diff --git a/samen_core/lib/samen/ai/agent.ex b/samen_core/lib/samen/ai/agent.ex
index 647f225..42f9d04 100644
--- a/samen_core/lib/samen/ai/agent.ex
+++ b/samen_core/lib/samen/ai/agent.ex
@@ -2470,7 +2470,7 @@ defmodule Samen.AI.Agent do
         "pending" => pending,
         "ui_view" => lines,
         "llm_view" => lines,
-        "folds" => []
+        "folds" => ["FAKE-PARK-FOLD-CANARY"]
       })
 
   # ------------------------------------------------------------------------------------
