scripts/sabotages/208-o9-dsar-audit-precondition-swallowed.patch
# SABOTAGE: O9 — the DSAR audit-write PRECONDITION is defeated. The fix makes the
# "who exported what" access record a HARD PRECONDITION of returning the bundle: if the
# audit append fails, export_subject/2 returns {:error, {:audit_write_failed, _}} and hands
# back NO bundle (non-repudiation on a GDPR Art. 15 compliance surface). This sabotage
# reverts it to the best-effort swallow (`_ = record_export(...); {:ok, bundle}`), so an
# export completes with ZERO record of who exported whose data. The precondition red path
# MUST flip: under a failing chain the export now returns {:ok, bundle} instead of an error.
# APP: samen_core
# TEST_FILES: test/dsar_audit_precondition_test.exs
# MUST_FAIL: writes NO dsar_export record
diff --git a/samen_core/lib/samen/dsar.ex b/samen_core/lib/samen/dsar.ex
index 8f79764..0294559 100644
--- a/samen_core/lib/samen/dsar.ex
+++ b/samen_core/lib/samen/dsar.ex
@@ -96,11 +96,9 @@ defmodule Samen.Dsar do
       audit_trail: audit_trail
     }
 
-    # The access record is a HARD PRECONDITION (O9): no non-repudiation record → no bundle.
-    case record_export(repo, org_id, subject_id, actor_id, plane, length(personal_data)) do
-      {:ok, _entry} -> {:ok, bundle}
-      {:error, reason} -> {:error, {:audit_write_failed, reason}}
-    end
+    _ = record_export(repo, org_id, subject_id, actor_id, plane, length(personal_data))
+
+    {:ok, bundle}
   end
 
   # The masking decision — the two-plane rule (mirrors Samen.Scope.ApiKey.masking_for).
