scripts/sabotages/326-adr048-cf17d-scripted-error-usage-dropped.patch
# SABOTAGE: CF-17(d) (ADR-048 §6 Level 2 constraint 1) — the three-element
# `{:error, reason, usage}` arm is REMOVED from `Samen.AI.Provider.Scripted`. Both halves of
# the arm go: the `normalize/1` clause that recognises the scripted entry, and the matching
# arm in `complete/2`'s `case`. A scripted failure that SPENT tokens then falls through to
# the malformed catch-all `defp normalize(_other), do: {:error, :not_configured}` and comes
# back as a bare two-element `{:error, :not_configured}` — the usage is silently swallowed
# and the failed call reports spending nothing. ADR-048 §6 Level 2 requires the opposite:
# "the failed attempt's tokens still count toward `max_input_tokens` (it was a real call)",
# which they cannot do if the failed call cannot say what it spent.
#
# Flips the named CF-17(d) red. Everything else stays GREEN, which is what makes the red
# mean what it says: the CF-17(d) POSITIVE CONTROL (a SUCCESSFUL scripted call still returns
# its usage unchanged, asserted against the very same `@scripted_usage` binding) still
# passes, and so do the pre-existing `Samen.AI.Provider.Scripted` contract tests in the same
# file (`fail-honest: no script / exhausted script NEVER yields {:ok, _}`, the head-match
# refusal and the determinism arm) — so the red fails because the error-with-usage arm is
# gone, not because the double, the chokepoint or the fail-honest floor broke.
#
# FAIL-HONEST IS UNTOUCHED BY THIS SABOTAGE AND BY THE ARM IT REMOVES: `:exhausted ->
# {:error, :not_configured}`, `{:error, reason} -> {:error, reason}` and the catch-all all
# stay byte-identical. The arm widens an ERROR return to carry usage; it never softens a
# failure into an `{:ok, _}`.
#
# Deletes the two added blocks and leaves a `# SABOTAGE` comment in each place, so the file
# still compiles under `--warnings-as-errors` (dropping only the `normalize/1` clause would
# leave the `case` arm unreachable). Touches scripted.ex ALONE.
#
# Anchored on GB1's own increment: the arm this patch removes does not exist at GB1's PREV
# (a963d55), so this patch deliberately does NOT apply there — see
# _orch-runs/.../nodes/GB1/work/sweep/anchor.txt.
# APP: samen_core
# TEST_FILES: test/ai/agent_loop_test.exs
# MUST_FAIL: RED: a scripted {:error, reason, usage} entry carries its usage out of complete/2
diff --git a/samen_core/lib/samen/ai/provider/scripted.ex b/samen_core/lib/samen/ai/provider/scripted.ex
--- a/samen_core/lib/samen/ai/provider/scripted.ex
+++ b/samen_core/lib/samen/ai/provider/scripted.ex
@@ -81,9 +81,7 @@
       # Fail-honest: nothing (left) scripted = no work done. NEVER a canned {:ok, _}.
       :exhausted -> {:error, :not_configured}
       {:error, reason} -> {:error, reason}
-      # CF-17(d): a scripted failure that SPENT tokens reports what it spent — still an
-      # :error (never a canned {:ok, _}), now carrying what the call actually cost.
-      {:error, reason, usage} -> {:error, reason, usage}
+      # SABOTAGE: the three-element error arm is REMOVED from the case.
       %{text: _} = entry -> {:ok, scripted_completion(entry)}
     end
   end
@@ -145,11 +143,7 @@
 
   defp normalize({:error, reason}), do: {:error, reason}
 
-  # CF-17(d): the token-budget sugar for a FAILED turn. WITHOUT this clause the entry falls
-  # through to the malformed catch-all below and the usage it carries is silently swallowed —
-  # the failed call then reports spending nothing. A non-map usage is a test-authoring bug and
-  # still refuses honestly down there.
-  defp normalize({:error, reason, usage}) when is_map(usage), do: {:error, reason, usage}
+  # SABOTAGE: the three-element normalize/1 clause is REMOVED.
 
   defp normalize(%{text: text} = entry) when is_binary(text), do: entry
 
