scripts/sabotages/353-t170-postmark-429-throttle-clauses-removed.patch
# SABOTAGE: T170 (bug half) — the THROTTLE clauses are REMOVED from
# `SamenPostmark.Provider.handle_response/1`, restoring the exact pre-T170 state: a
# Postmark `429` falls through to the generic `{:postmark_error, 429, code, msg}` arm.
# That tuple is what the delivery Oban workers hand straight back to Oban, so Oban retries
# on its ordinary exponential schedule — against an account that has just said "you are
# sending too fast" — and burns one of 20 attempts per hammer. That is a retry storm aimed
# at the operator's own ESP account.
#
# Flips the named reds in `test/throttle_test.exs`: the 429-with-Retry-After case, the
# 429-without-a-header case (default wait), and the body-`ErrorCode`-429 case. Each asserts
# the DISTINCT `{:error, {:throttled, seconds}}`; with the clauses gone they get the
# generic Postmark error back instead.
#
# The POSITIVE CONTROLS in the same file still PASS — a `500` and a `422` keep their exact
# `{:postmark_error, …}` tuples, a `2xx` still delivers with its `provider_message_id`, and
# a transport-level `{:error, reason}` is unchanged — so the reds fail because the throttle
# is unrecognised, not because error handling, delivery or the injected transport broke.
#
# NOT TOUCHED, deliberately: `Samen.Delivery.Throttle` itself and its clamp/header matrix
# (its own reds own that), the workers' snooze arms (356 owns that), and the SES/Resend
# adapters (354/355 own those) — so this red isolates Postmark's own recognition step.
# The transport still CARRIES `:headers`, so the plumbing is present and simply never
# consulted: the "we collected the evidence and then ignored it" shape.
#
# Removes three contiguous regions (the `Throttle` alias entry, the two throttle clauses,
# the `headers/1` helper) so nothing is left unused and the file compiles under
# `--warnings-as-errors`. Touches samen_postmark's provider.ex ALONE.
# APP: samen_postmark
# TEST_FILES: test/throttle_test.exs
# MUST_FAIL: T170 RED: a Postmark 429 is a throttle carrying Retry-After, not a generic error
# MUST_FAIL: T170 RED: a Postmark 429 with no Retry-After header still throttles, at the default wait
# MUST_FAIL: T170 RED: a body ErrorCode of 429 throttles even if a gateway rewrote the status
diff --git a/samen_postmark/lib/samen_postmark/provider.ex b/samen_postmark/lib/samen_postmark/provider.ex
--- a/samen_postmark/lib/samen_postmark/provider.ex
+++ b/samen_postmark/lib/samen_postmark/provider.ex
@@ -51,7 +51,7 @@
 
   use Samen.Delivery.Provider
 
-  alias Samen.Delivery.{InboundMessage, Message, ProviderEvent, Throttle}
+  alias Samen.Delivery.{InboundMessage, Message, ProviderEvent}
   alias SamenPostmark.Transport
 
   # Postmark `RecordType` -> the bounded, samen-owned ProviderEvent kind enum
@@ -194,15 +194,8 @@
     {:ok, %{provider_message_id: id}}
   end
 
-  # T170 — THROTTLE, before the generic error clauses. Ordered first among the error
-  # arms so a `429` can never be read as an ordinary Postmark error again.
-  defp handle_response({:ok, %{status: 429} = response}) do
-    Throttle.throttled(headers(response))
-  end
-
-  defp handle_response({:ok, %{body: %{"ErrorCode" => 429}} = response}) do
-    Throttle.throttled(headers(response))
-  end
+  # SABOTAGE (T170): the THROTTLE clauses are GONE — a Postmark 429 falls through to the
+  # generic error arm again, so Oban retries it and burns an attempt per hammer.
 
   defp handle_response({:ok, %{status: status, body: %{"ErrorCode" => code, "Message" => msg}}}) do
     {:error, {:postmark_error, status, code, msg}}
@@ -214,11 +207,6 @@
 
   defp handle_response({:error, reason}), do: {:error, reason}
 
-  # A fake transport (the §7.2 injectable hook, used by every hermetic test) may omit
-  # `:headers`; an absent header set is not an error, it just means the wait falls back
-  # to `Samen.Delivery.Throttle.default_seconds/0`.
-  defp headers(response), do: Map.get(response, :headers, %{})
-
   # ---------------------------------------------------------------------------
   # verify_and_parse_event/3
 
