scripts/sabotages/235-s6-security-credential-oracle-ungoverned.patch
# SABOTAGE: S6 (luminary panel-2) — `SecurityLive.credential_id_for/3` reverts to the ungoverned
# `Ash.read!(authorize?: false)` (dropping the org-scoped `Ash.read!(scope: scope)` + `limit(1)`),
# reinstating the global `user_id → credential_id` oracle: a cross-org user id again resolves that
# foreign user's credential id (the pivot in the S3 chain — the key to the TOTP-enroll + session-list
# surfaces). `Samen.Policy.OrgScope` is bypassed, so the boundary is gone. Flips the cross-org red-path
# (a foreign user_id must resolve NO credential id).
# APP: samen_web
# TEST_FILES: test/samen/web/security_credential_scope_test.exs
# MUST_FAIL: a cross-org user_id resolves NO credential id (the 2FA link carries no foreign credential)
diff --git a/samen_web/lib/samen/web/settings/security_live.ex b/samen_web/lib/samen/web/settings/security_live.ex
index 4aafa8a..d482a63 100644
--- a/samen_web/lib/samen/web/settings/security_live.ex
+++ b/samen_web/lib/samen/web/settings/security_live.ex
@@ -230,8 +230,7 @@ defmodule Samen.Web.Settings.SecurityLive do
     Mount.resource(mount, User)
     |> Ash.Query.filter(id == ^user_id)
     |> Ash.Query.select([:credential_id])
-    |> Ash.Query.limit(1)
-    |> Ash.read!(scope: scope)
+    |> Ash.read!(authorize?: false)
     |> case do
       [%{credential_id: credential_id}] -> credential_id
       _ -> nil
