scripts/sabotages/240-a1-agent-budget-exhaustion-promotes-partial-answer.patch
# SABOTAGE: A1 (ADR-047 §6 / RP-AG-6) gate sabotage — the agent loop's fail-honest budget
# floor. Budget exhaustion in Samen.AI.Agent's turn-boundary check no longer terminates
# `:budget_exhausted` with `{:error, :budget_exhausted, run}` — it PROMOTES the last
# assistant turn's text to `{:ok, %{answer: ...}}` and finalizes the run `:succeeded`,
# i.e. a partial answer dressed as a result for a goal the model never finished. That is
# the exact lie the non-configurable fail-honest floor forbids (operator decision §9#3
# TAKEN: values configurable, the never-a-partial-answer semantics not). Flips the named
# budget-honesty red tests (max-turns + both token budgets); their positive controls (the
# SAME script under a sufficient budget succeeding with the REAL answer) stay green —
# proving the reds fail because exhaustion turned dishonest, not because the loop died.
# APP: samen_core
# TEST_FILES: test/ai/agent_loop_test.exs
# MUST_FAIL: the last turn is NOT promoted
# MUST_FAIL: input-token budget exhausts
# MUST_FAIL: output-token budget exhausts
diff --git a/samen_core/lib/samen/ai/agent.ex b/samen_core/lib/samen/ai/agent.ex
index d46b2e0..571d02a 100644
--- a/samen_core/lib/samen/ai/agent.ex
+++ b/samen_core/lib/samen/ai/agent.ex
@@ -310,12 +310,17 @@ defmodule Samen.AI.Agent do
         {:error, :cancelled, run}
 
       budget_kind != nil ->
-        # Fail-honest exhaustion (RP-AG-6): an explicit terminal state + a bounded kind.
-        # `history` — including any last assistant text — is deliberately DROPPED, never
-        # promoted to an answer (sabotage 240 keeps this refutable).
-        run = terminal!(run, :exhaust, budget_kind)
+        # SABOTAGE (A1, RP-AG-6): budget exhaustion PROMOTES the last assistant turn to a
+        # success — the run finalizes :succeeded and the caller gets {:ok, answer} for a
+        # goal the model never finished. The exact "partial answer dressed as a result"
+        # lie the fail-honest floor forbids (ADR-047 §6).
+        run =
+          run
+          |> Ash.Changeset.for_update(:succeed, %{})
+          |> Ash.update!(authorize?: false)
+
         log_terminal(run)
-        {:error, :budget_exhausted, run}
+        {:ok, %{answer: List.last(history) || "", run: run, turns: run.current_turn}}
 
       true ->
         execute_turn(run, scope, definition, goal, history, opts)
