scripts/sabotages/241-a1-agent-cancel-recheck-run-start-only.patch
# SABOTAGE: A1 (ADR-047 §6 / RP-AG-8) gate sabotage — the agent loop's durable-interrupt
# semantics. The durable cancel re-check (`cancel_requested_at`, set by
# Samen.AI.Agent.cancel/2) moves from EVERY turn boundary to RUN START only — the
# Automation.RunWorker "already-queued half" lesson reversed: a tenant cancel (or, in A2,
# an operator kill) landing between turn N and turn N+1 is silently ignored and the run
# keeps burning turns/budget to its own conclusion. Flips the named cancel red test (a
# cancel issued DURING turn 2 must stop turn 3); its positive control (the same script
# WITHOUT the cancel running turn 3 to the final answer) stays green — proving the red
# fails because the per-turn re-check is gone, not because the loop died.
# APP: samen_core
# TEST_FILES: test/ai/agent_loop_test.exs
# MUST_FAIL: a cancel issued DURING turn 2 stops turn 3
diff --git a/samen_core/lib/samen/ai/agent.ex b/samen_core/lib/samen/ai/agent.ex
index d46b2e0..3b314b2 100644
--- a/samen_core/lib/samen/ai/agent.ex
+++ b/samen_core/lib/samen/ai/agent.ex
@@ -196,7 +196,20 @@ defmodule Samen.AI.Agent do
         {:error, :tools_not_supported, terminal!(run, :fail, :tools_not_supported)}
       else
         run = begin!(run)
-        loop(run, scope, definition, goal, [], opts)
+
+        # SABOTAGE (A1, RP-AG-8): the durable-cancel check runs ONCE, at run start, instead
+        # of at every turn boundary — a cancel landing between turn N and N+1 is silently
+        # ignored and the run keeps executing turns.
+        if run.cancel_requested_at != nil do
+          cancelled =
+            run
+            |> Ash.Changeset.for_update(:cancel, %{})
+            |> Ash.update!(authorize?: false)
+
+          {:error, :cancelled, cancelled}
+        else
+          loop(run, scope, definition, goal, [], opts)
+        end
       end
     end
   end
@@ -300,15 +313,6 @@ defmodule Samen.AI.Agent do
     budget_kind = over_budget(run, DateTime.utc_now())
 
     cond do
-      run.cancel_requested_at != nil ->
-        run =
-          run
-          |> Ash.Changeset.for_update(:cancel, %{})
-          |> Ash.update!(authorize?: false)
-
-        log_terminal(run)
-        {:error, :cancelled, run}
-
       budget_kind != nil ->
         # Fail-honest exhaustion (RP-AG-6): an explicit terminal state + a bounded kind.
         # `history` — including any last assistant text — is deliberately DROPPED, never
