scripts/sabotages/241-a1-agent-cancel-recheck-run-start-only.patch
# SABOTAGE: A1/A2 (ADR-047 §6 / RP-AG-8) gate sabotage — the agent loop's durable-interrupt
# semantics. The durable cancel re-check (`cancel_requested_at`, set by
# Samen.AI.Agent.cancel/2) moves from EVERY turn boundary to RUN START only — the
# Automation.RunWorker "already-queued half" lesson reversed: a tenant cancel landing
# between turn N and turn N+1 is silently ignored and the run keeps burning turns/budget
# to its own conclusion. Flips the named cancel red test (a cancel issued DURING turn 2
# must stop turn 3); its positive control (the same script WITHOUT the cancel running
# turn 3 to the final answer) stays green — proving the red fails because the per-turn
# re-check is gone, not because the loop died.
# APP: samen_core
# TEST_FILES: test/ai/agent_loop_test.exs
# MUST_FAIL: a cancel issued DURING turn 2 stops turn 3
diff --git a/samen_core/lib/samen/ai/agent.ex b/samen_core/lib/samen/ai/agent.ex
--- a/samen_core/lib/samen/ai/agent.ex
+++ b/samen_core/lib/samen/ai/agent.ex
@@ -265,7 +265,20 @@
          :ok <- Breaker.check_start(org_id, definition.name) do
       run = create_run!(agent_mod, definition, org_id, scope, goal, budgets, opts)
       run = begin!(run)
-      loop(run, scope, definition, Keyword.put(opts, :resolved_tools, tools), :infinity)
+
+      # SABOTAGE (A1/A2, RP-AG-8): the durable-cancel check runs ONCE, at run start,
+      # instead of at every turn boundary — a cancel landing between turn N and N+1 is
+      # silently ignored and the run keeps executing turns.
+      if run.cancel_requested_at != nil do
+        cancelled =
+          run
+          |> Ash.Changeset.for_update(:cancel, %{})
+          |> Ash.update!(authorize?: false)
+
+        {:error, :cancelled, cancelled}
+      else
+        loop(run, scope, definition, Keyword.put(opts, :resolved_tools, tools), :infinity)
+      end
     end
   end
 
@@ -615,15 +628,6 @@
     budget_kind = over_budget(run, DateTime.utc_now())
 
     cond do
-      run.cancel_requested_at != nil ->
-        run =
-          run
-          |> Ash.Changeset.for_update(:cancel, %{})
-          |> Ash.update!(authorize?: false)
-
-        log_terminal(run)
-        {:error, :cancelled, run}
-
       Breaker.killed?(run.org_id, run.agent) ->
         # Fail-closed interrupt (A2, §6): an operator kill between turn N and N+1 stops
         # turn N+1 — the in-flight turn completed and was recorded honestly. A5 widens
