scripts/sabotages/255-a4-agent-tool-result-sentinel-egress.patch
# SABOTAGE: A4 fold (c) (ADR-047 §4.3 steps 2/3/6) gate sabotage — the tool-result
# renderer stops scanning scalars for the `vt_` vault-token sentinel, so a
# tenant/attacker-controlled column value carrying one is rendered VERBATIM into the
# transcript and the next turn's history. Two ADR properties break at once: §4.3 step 3's
# "the transcript at rest contains no vault plaintext and no vt_* token", and §4.3#6's
# "rendered to a single vt_-FREE binary". Downstream, the chokepoint's allowlist catches
# it — which is the OTHER half of the harm: the whole governed run dies
# `:pii_egress_refused` because of one attacker-supplied string, the tenant-DoS shape the
# per-value elision exists to remove. The named reds (the unit renderer assertion and the
# end-to-end no-hard-fail run) must flip; the clean-scalar positive control and the
# last-line chokepoint assertion stay green, proving the belt-and-braces refusal is intact
# and only the normal path regressed.
# REGENERATED at T182: the T182 ingress pass rewrote the exact `render_scalar/2` binary
# clause this hunk anchored on. Same defect (the `vt_` sentinel scan is dropped), same two
# MUST_FAIL targets, re-verified flip + byte-exact restore. The sabotaged clause keeps the
# ingress sanitize call so ONLY the sentinel scan is removed — the defect is not widened.
# REGENERATED AGAIN at T184: the secrets-redaction pass (`Secrets.redact/1`) was inserted
# into the SAME `render_scalar/2` clause ahead of `Ingress.sanitize/1`. Same defect (the
# `vt_` sentinel scan is dropped), same two MUST_FAIL targets, re-verified flip + byte-exact
# restore. The sabotaged clause keeps BOTH the redact and sanitize calls so only the
# sentinel scan is removed — the defect is not widened.
# RE-ANCHORED at T222: A11's perf bound folded the redact+sanitize pair into
# `redacted_and_sanitized/1`, so the clause body the T184 hunk anchored on no longer exists.
# Same defect (the `vt_` sentinel scan is dropped), same two MUST_FAIL targets, re-verified
# flip + byte-exact restore. The sabotaged clause still calls `redacted_and_sanitized/1`, so
# ONLY the sentinel scan is removed — the defect is not widened.
# APP: samen_core
# TEST_FILES: test/ai/agent_tools_test.exs
# MUST_FAIL: emit [unrenderable:<key>] for a vt_-bearing scalar
# MUST_FAIL: does NOT hard-fail the run
diff --git a/samen_core/lib/samen/ai/agent/tool_result.ex b/samen_core/lib/samen/ai/agent/tool_result.ex
index 6122933..4ae1e28 100644
--- a/samen_core/lib/samen/ai/agent/tool_result.ex
+++ b/samen_core/lib/samen/ai/agent/tool_result.ex
@@ -437,12 +437,10 @@ defmodule Samen.AI.Agent.ToolResult do
   # the FULL, unbounded `v` (never windowed — the vt_ floor must not narrow), and truncation to
   # `@max_scalar_bytes` still runs AFTER the scan, on the bounded transform's output, exactly as
   # before.
-  defp render_scalar(v, key) when is_binary(v) do
-    sanitized = redacted_and_sanitized(v)
-
-    if sentinel?(v) or sentinel?(sanitized),
-      do: unrenderable(key),
-      else: truncate(sanitized)
+  defp render_scalar(v, _key) when is_binary(v) do
+    # SABOTAGE (A4 fold (c), ADR-047 §4.3): the sentinel scan is GONE — a vt_-bearing
+    # scalar renders verbatim into the transcript and the next turn's history.
+    truncate(redacted_and_sanitized(v))
   end
 
   defp render_scalar(v, _key) when is_number(v), do: to_string(v)
