scripts/sabotages/86-t77-account-health-worst-of-n-regression.patch
# SABOTAGE: T77 fix round 1, MED-2 (spec §I4 "unfair advantage") — REGENERATED T160
# (context shifted: `billing_snapshot/2` now derives `subscription_status` from a DB-
# aggregate tier cascade, `worst_status_via_db/2`, instead of an in-memory
# `Enum.min_by` over a 200-row-bounded `Billing.Reads.subscriptions/2` read — T160 P4).
# Reverts `subscription_status` from the WORST status across EVERY subscription this org
# holds back to the PRE-fix-round-1 "primary" selection: prefer the FIRST active/trialing
# subscription found (within a reconstructed 200-row-bounded read, mirroring the OLD
# `Billing.Reads.subscriptions/2` shape), else the last one — i.e. cherry-pick the
# BEST-looking subscription and ignore every sibling's status entirely. An org with one
# healthy subscription and one genuinely past_due sibling (no invoice rows needed — the
# SUBSCRIPTION status alone is dunning-worthy) would render "the worst subscription state
# on file is 'active' — current, no past-due invoices anywhere in the book" — literally
# false, and the exact bug the delta verdict's MED-2 finding identified. Reverts
# byte-exact. Blast radius WIDER than the original patch 86 (2 tests): T160's P3/P4
# tests ALSO depend on the true worst-of-N/unbounded aggregate, so they flip too —
# declared honestly below (the T77 delta round's own INFO finding on patch 85's
# under-declared header, P7 in the phase-6 punchlist, is not repeated here).
# APP: samen_web
# TEST_FILES: test/samen/web/crm_account_health_test.exs
# MUST_FAIL: snapshot/2 WORST-OF-N (fix round 1, MED-2): an active sub + a sibling past_due sub reports the WORST status, never the best one
# MUST_FAIL: FIRST-CLIENT WORST-OF-N (fix round 1, MED-2): CompanyLive never claims the book is current when a sibling subscription is past due
# MUST_FAIL: T160 P3: PORTFOLIO FLOOR fixed — one historical cancelled subscription among many healthy ones no longer pins billing to 0.0
# MUST_FAIL: T160 P4: portfolio worst-status/past-due are TRUE DB aggregates, not a 200-row-bounded approximation
diff --git a/samen_web/lib/samen/web/account_health.ex b/samen_web/lib/samen/web/account_health.ex
--- a/samen_web/lib/samen/web/account_health.ex
+++ b/samen_web/lib/samen/web/account_health.ex
@@ -569,7 +569,11 @@
       active_subs: metrics.active_subs,
       # TRUE worst-of-N across EVERY subscription this org holds (fix round 1, MED-2)
       # — the honest "worst status in book" DISPLAY text, cancelled included.
-      subscription_status: worst_status_via_db(sub_query, scope),
+      subscription_status:
+        (fn ->
+           subs = sub_query |> Ash.Query.ensure_selected([:status]) |> Ash.Query.limit(200) |> Ash.read!(scope: scope)
+           (Enum.find(subs, &(&1.status in [:active, :trialing])) || List.last(subs)) |> then(&(&1 && &1.status))
+         end).(),
       # T160 P3 — the worst status among the LIVE (non-cancelled) subset, which is what
       # actually DRIVES the billing factor's value (see `billing_factor/1`'s doc).
       scoring_status: live_worst_status_via_db(sub_query, scope),
