scripts/sabotages/291-t184-secrets-redact-noop.patch
# SABOTAGE: T184 (ADR-047 §4.3b, the PROPOSED secrets-redaction addendum) gate sabotage —
# the secrets-redaction pass becomes a NO-OP. `Samen.AI.Agent.Secrets.redact/1` still runs
# both the vendor-prefix pass and the generic labeled-fallback pass and then DISCARDS their
# result, returning the raw untrusted binary, so a governed tool result's attacker/tenant-
# controlled scalar carrying an operator/app API key, token, or credentialed connection
# string enters the loop's `:history` byte for byte — the whole lane §4.3b exists to add,
# distinct from `pii_*` (a declared-field taxonomy this fixture carries none of). The two
# named secrets reds (one known-vendor, one unrecognized-generic) MUST flip; the CLEAN
# positive control and the pii_*/vt_ egress assertions in the same file stay green, proving
# the failure is the redaction pass and not the renderer or the ingress sanitizer breaking.
# APP: samen_core
# TEST_FILES: test/ai/agent_ingress_test.exs
# MUST_FAIL: a KNOWN vendor-shaped secret (no pii_* field anywhere on this fixture) redacts
# MUST_FAIL: an UNRECOGNIZED-but-labeled secret (fail-closed generic fallback) redacts
diff --git a/samen_core/lib/samen/ai/agent/secrets.ex b/samen_core/lib/samen/ai/agent/secrets.ex
--- a/samen_core/lib/samen/ai/agent/secrets.ex
+++ b/samen_core/lib/samen/ai/agent/secrets.ex
@@ -139,9 +139,16 @@
   """
   @spec redact(binary()) :: binary()
   def redact(value) when is_binary(value) do
+    # SABOTAGE (T184, ADR-047 §4.3b): the redaction pass is a NO-OP. Both passes still run
+    # and their result is DISCARDED, so the RAW untrusted binary is what the renderer emits
+    # and what enters the loop's :history — every vendor-shaped and labeled-fallback secret
+    # survives verbatim.
+    _redacted =
+      value
+      |> redact_vendor_patterns()
+      |> redact_labeled_fallback()
+
     value
-    |> redact_vendor_patterns()
-    |> redact_labeled_fallback()
   end
 
   @doc "The marker every redacted span collapses to. Exposed so tests assert one constant."
