scripts/sabotages/296-uxd05-known-residual-disclosure-deleted.patch
# SABOTAGE: UXD-05 attempt-3 — the F-4 raw-spawn lock's KNOWN RESIDUALS disclosure is
# deleted from the tier moduledoc. T11-verdict.json refuted attempt 2 for claiming the
# behavioural negative-control test "pinned" this documentation: the verifier deleted the
# paragraph and that test stayed GREEN, because it asserts only that the Module.concat
# fixture goes undetected — true with or without the disclosure. The lock's residuals are
# now pinned by reading the tier source itself, and THIS patch is the proof that the pin
# is refutable. A security control with a silent bypass is worse than one with a documented
# limit, so the disclosure is a deliverable and deleting it must turn a test red.
# (Regenerated at UXD-05 attempt 4: the paragraph now carries a FOURTH residual,
# module-attribute indirection, so the old hunk no longer applied.)
# (Regenerated at T222: A9 rewrote residual 4 in place — module-attribute indirection is now
# PARTIALLY CLOSED and the paragraph names the still-open chaining case — so the attempt-4 hunk
# no longer applied. Same deletion, the whole KNOWN RESIDUALS disclosure plus its "pinned by
# negative-control tests" closing line, and the same MUST_FAIL target.)
# APP: samen_core
# TEST_FILES: test/ai/agent_coverage_verifier_test.exs
# MUST_FAIL: KNOWN RESIDUAL — the disclosure itself is pinned in the tier source
diff --git a/samen_core/lib/mix/tasks/samen.verify.agent_coverage.ex b/samen_core/lib/mix/tasks/samen.verify.agent_coverage.ex
index 126fcaa..67e023c 100644
--- a/samen_core/lib/mix/tasks/samen.verify.agent_coverage.ex
+++ b/samen_core/lib/mix/tasks/samen.verify.agent_coverage.ex
@@ -50,43 +50,6 @@ defmodule Mix.Tasks.Samen.Verify.AgentCoverage do
       pre-fix literal one. See `resolves_to_kernel?/3` for the termination argument — no
       alias cycle, and no self-growing alias such as `alias A.B, as: A`, can hang the scan.
 
-      **KNOWN RESIDUALS — DOCUMENTED, NOT CLOSED.** This lock is a static AST scan of one
-      file at a time. It does NOT catch, and does not claim to:
-
-        1. **Dynamic module construction.** `mod = Module.concat(Samen.AI, Agent);
-           apply(mod, :start, [...])`. No `__aliases__` node and no atom literal names the
-           target at the call site, so there is nothing static to resolve — a DISTINCT
-           vulnerability class from an alias rename (which is a compile-time textual
-           substitution the AST still names). Closing it needs data-flow/taint tracking and
-           should be scoped as its own item, not folded in here silently.
-        2. **The unparsable-source fallback.** When `Code.string_to_quoted/2` fails, the
-           scan degrades to `reentry_regex_fallback?/1`, a hardcoded literal-name regex with
-           NO alias tracking at all: every rename above evades that branch. It is reached
-           only by source that does not compile.
-        3. **Indirection through another module or a macro.** A reference the kernel gains
-           only after macro expansion, or a call routed through a helper module in a
-           different file, is invisible to a per-file pre-expansion scan.
-        4. **MODULE-ATTRIBUTE INDIRECTION** (UXD-05 attempt 4, named here because it was
-           found live and silent; PARTIALLY CLOSED AT A9). `@k Samen.AI.Agent` followed by `@k.start(...)`
-           or `apply(@k, :start, [...])` INSIDE a `tool_schema/0` module was a working call
-           this lock did not flag. A9 closed the single, static, TOP-LEVEL ASSIGNMENT case:
-           `attr_env/1` (new) collects every top-level `@name <value>` assignment the same
-           way `alias_env/1` collects `alias`/`require` bindings, and `agent_kernel_alias?/2`
-           gained an `{:@, _, _}` clause resolving an attribute reference through the same
-           alias/atom machinery every other reference uses — so the worked example above IS
-           FLAGGED NOW. What A9 deliberately did NOT attempt, and what remains open:
-           attribute REASSIGNMENT ordering, ACCUMULATION (`Module.register_attribute/3,
-           accumulate: true`), and attribute-of-attribute CHAINING (`@k @j`, one attribute
-           assigned from another) — each is data-flow through a binding, the same class
-           residual 1 (dynamic module construction) already declines to fold in. This is a
-           STATED, TESTED limit: the closed case is pinned by the "RED FIXTURE (A9)" tests
-           and the open chaining case by "KNOWN RESIDUAL (A9, still open) — attribute-of-
-           attribute chaining" in `test/ai/agent_coverage_verifier_test.exs`.
-
-      Residuals 1 and 4 are pinned by negative-control tests, and a further test asserts
-      this paragraph is still present in this source, so deleting any disclosure above
-      turns it red (`test/ai/agent_coverage_verifier_test.exs`, the "KNOWN RESIDUAL" tests).
-
       **Unqualified `import`.** `import Samen.AI.Agent` binds `start/…` and `run/…` as bare
       names, which no qualified-call clause can see. `imported_kernel_reentry?/2` closes
       that: when a file imports the kernel (resolved through the same alias environment), a
