scripts/sabotages/299-uxd05-residual-4-module-attribute-disclosure-deleted.patch
# SABOTAGE: UXD-05 attempt-4 — residual 4 (MODULE-ATTRIBUTE INDIRECTION) is deleted from
# the F-4 lock's KNOWN RESIDUALS disclosure, exactly the way that class was silent at
# `33723d8`. V11's refutation of attempt 3 was NOT "an evasion exists" but "that class is
# UNDISCLOSED, unpinned by any test, and covered by none of the moduledoc residuals" — the
# silent-bypass condition the directive names. Patch 296 proved the pin refutable for the
# ORIGINAL four fragments only; a pin cannot protect a residual nobody wrote down, so this
# patch proves the pin now covers the fragments added at attempt 4 too. Regenerated at A9's
# W4 follow-up (`de98c9b` widened the lock and closed the paragraph's single-assignment
# worked example; this patch now deletes the REWRITTEN paragraph — closed case + the
# reassignment/accumulation/attribute-chaining residual that stays open — so the disclosure
# stays undeletable-in-silence after the widening). The BEHAVIOURAL negative-control tests
# stay green under this patch (the code is untouched) — only the documentation pin flips,
# which is the whole point.
# APP: samen_core
# TEST_FILES: test/ai/agent_coverage_verifier_test.exs
# MUST_FAIL: KNOWN RESIDUAL — the disclosure itself is pinned in the tier source
diff --git a/samen_core/lib/mix/tasks/samen.verify.agent_coverage.ex b/samen_core/lib/mix/tasks/samen.verify.agent_coverage.ex
--- a/samen_core/lib/mix/tasks/samen.verify.agent_coverage.ex
+++ b/samen_core/lib/mix/tasks/samen.verify.agent_coverage.ex
@@ -66,22 +66,6 @@
         3. **Indirection through another module or a macro.** A reference the kernel gains
            only after macro expansion, or a call routed through a helper module in a
            different file, is invisible to a per-file pre-expansion scan.
-        4. **MODULE-ATTRIBUTE INDIRECTION** (UXD-05 attempt 4, named here because it was
-           found live and silent; PARTIALLY CLOSED AT A9). `@k Samen.AI.Agent` followed by `@k.start(...)`
-           or `apply(@k, :start, [...])` INSIDE a `tool_schema/0` module was a working call
-           this lock did not flag. A9 closed the single, static, TOP-LEVEL ASSIGNMENT case:
-           `attr_env/1` (new) collects every top-level `@name <value>` assignment the same
-           way `alias_env/1` collects `alias`/`require` bindings, and `agent_kernel_alias?/2`
-           gained an `{:@, _, _}` clause resolving an attribute reference through the same
-           alias/atom machinery every other reference uses — so the worked example above IS
-           FLAGGED NOW. What A9 deliberately did NOT attempt, and what remains open:
-           attribute REASSIGNMENT ordering, ACCUMULATION (`Module.register_attribute/3,
-           accumulate: true`), and attribute-of-attribute CHAINING (`@k @j`, one attribute
-           assigned from another) — each is data-flow through a binding, the same class
-           residual 1 (dynamic module construction) already declines to fold in. This is a
-           STATED, TESTED limit: the closed case is pinned by the "RED FIXTURE (A9)" tests
-           and the open chaining case by "KNOWN RESIDUAL (A9, still open) — attribute-of-
-           attribute chaining" in `test/ai/agent_coverage_verifier_test.exs`.

       Residuals 1 and 4 are pinned by negative-control tests, and a further test asserts
       this paragraph is still present in this source, so deleting any disclosure above
