scripts/sabotages/355-t170-resend-429-throttle-clauses-removed.patch
# SABOTAGE: T170 (bug half) — the THROTTLE clauses are REMOVED from
# `SamenResend.Provider.handle_response/1`, restoring the exact pre-T170 state: a Resend
# `429` falls through to the generic `{:resend_error, status, name, message}` arm. That
# tuple is what the delivery Oban workers hand straight back to Oban, so Oban retries on
# its ordinary exponential schedule — against an account that has just said "limit to 2
# requests per second" — and burns one of 20 attempts per hammer.
#
# Flips the named reds in `test/throttle_test.exs`: `rate_limit_exceeded` with a
# `Retry-After`, `daily_quota_exceeded` without one (default wait), the
# `ratelimit-reset`-only case, and the name-matched case whose status a gateway rewrote.
# Each asserts the DISTINCT `{:error, {:throttled, seconds}}`; with the clauses gone they
# get the generic Resend error back instead.
#
# The POSITIVE CONTROLS in the same file still PASS — a `500` internal_server_error, a
# non-throttle `422` validation_error, a non-map body, a `2xx` delivery and a
# transport-level `{:error, reason}` all keep their exact pre-T170 returns — so the reds
# fail because the throttle is unrecognised, not because Resend error handling or delivery
# broke.
#
# NOT TOUCHED, deliberately: `Samen.Delivery.Throttle` itself (its own reds own that), the
# workers' snooze arms (356 owns that), and the Postmark/SES adapters (353/354 own those).
# The transport still CARRIES `:headers`, so the plumbing is present and simply never
# consulted.
#
# Removes three contiguous regions (the `Throttle` alias entry, the two throttle clauses,
# the `headers/1` helper) so nothing is left unused and the file compiles under
# `--warnings-as-errors`. Touches samen_resend's provider.ex ALONE.
# APP: samen_resend
# TEST_FILES: test/throttle_test.exs
# MUST_FAIL: T170 RED: a Resend 429 rate_limit_exceeded is a throttle carrying Retry-After
# MUST_FAIL: T170 RED: daily_quota_exceeded is a throttle too, caught by NAME
# MUST_FAIL: T170 RED: ratelimit-reset is used when Retry-After is absent
# MUST_FAIL: T170 RED: the throttle NAME is caught even if a gateway rewrote the status
diff --git a/samen_resend/lib/samen_resend/provider.ex b/samen_resend/lib/samen_resend/provider.ex
--- a/samen_resend/lib/samen_resend/provider.ex
+++ b/samen_resend/lib/samen_resend/provider.ex
@@ -76,7 +76,7 @@
 
   use Samen.Delivery.Provider
 
-  alias Samen.Delivery.{Message, ProviderEvent, Throttle}
+  alias Samen.Delivery.{Message, ProviderEvent}
   alias SamenResend.{SvixSignature, Transport}
 
   # Real Resend webhook `type` -> the bounded, samen-owned ProviderEvent kind
@@ -190,21 +190,10 @@
   defp handle_response({:ok, %{status: status, body: %{"id" => id}}})
        when status in 200..201 and is_binary(id) do
     {:ok, %{provider_message_id: id}}
-  end
-
-  # T170 — THROTTLE, before the generic error clauses. Resend answers `429` and names
-  # the condition in the body's `name`: `rate_limit_exceeded` (the per-second limit) or
-  # `daily_quota_exceeded`. Matched BY NAME as well as by status, and the wait prefers
-  # Resend's `ratelimit-reset` header when `Retry-After` is absent. A `500` is
-  # untouched — that IS a retriable failure and still retries exactly as before.
-  defp handle_response({:ok, %{status: 429} = response}) do
-    Throttle.throttled(headers(response))
   end
 
-  defp handle_response({:ok, %{body: %{"name" => name}} = response})
-       when name in ["rate_limit_exceeded", "daily_quota_exceeded"] do
-    Throttle.throttled(headers(response))
-  end
+  # SABOTAGE (T170): the THROTTLE clauses are GONE — a Resend 429 falls through to the
+  # generic error arm again, so Oban retries it and burns an attempt per hammer.
 
   defp handle_response({:ok, %{status: status, body: %{"message" => msg} = body}}) do
     {:error, {:resend_error, status, Map.get(body, "name", "ResendError"), msg}}
@@ -216,11 +205,6 @@
 
   defp handle_response({:error, reason}), do: {:error, reason}
 
-  # A fake transport (the §7.2 injectable hook, used by every hermetic test) may omit
-  # `:headers`; an absent header set is not an error, it just means the wait falls back
-  # to `Samen.Delivery.Throttle.default_seconds/0`.
-  defp headers(response), do: Map.get(response, :headers, %{})
-
   # ---------------------------------------------------------------------------
   # verify_and_parse_event/3
 
