scripts/sabotages/52-t71-ai-analytics-aggregate-suppress-bypass.patch
# SABOTAGE: D7 (T71) gate sabotage — defeats the AI-analytics AGGREGATE NON-LEAK
# invariant (ADR-043 §6.4: an AI analytics answer must never surface an individual
# record's value through an aggregate — the classic min/max/sample-row/count-of-one
# leak). `Samen.AI.Analytics.ask/4` reads the aggregate resource ONLY through
# `Samen.Aggregate.read_all/2` with the ENFORCED defaults (`suppress: true`,
# `account: true`) — the k-anonymity/l-diversity floors (T4.5) run BEFORE any row
# reaches the AI narration, so a count-of-one cohort is already a
# `%Samen.Aggregate.Suppressed{}` sentinel (no number to leak) by the time `render/3`
# builds the narration text. This sabotage appends `suppress: false` to the read
# options `ask/4` forwards to `read_all/2` — the EXACT bypass the moduledoc names as
# "the exact aggregate-leak sabotage T71's red-team patch demonstrates": every row
# comes back RAW/unsuppressed, so a count-of-one tier's TRUE revenue (e.g. one
# tenant's exact Bespoke-tier MRR) now reaches the fake AI provider's recorded
# narration payload verbatim. This flips exactly the named AGGREGATE NON-LEAK test
# (`demo/test/ai_analytics_test.exs`), while the >=k Pro-tier positive-control
# assertion in the SAME test also still holds pre-sabotage (proving the guarantee is
# refutable, not vacuous) and the sabotage's own mechanism-proof test (which calls
# `Samen.Aggregate.read_all/2` directly, never through `Samen.AI.Analytics`) is
# UNAFFECTED by this patch — confirming the floor itself is intact and the LEAK is
# specifically in the analytics wrapper's read-options plumbing, not the floor.
# APP: demo
# TEST_FILES: test/ai_analytics_test.exs
# MUST_FAIL: a count-of-one tier's TRUE revenue never reaches the AI narration payload
diff --git a/samen_core/lib/samen/ai/analytics.ex b/samen_core/lib/samen/ai/analytics.ex
--- a/samen_core/lib/samen/ai/analytics.ex
+++ b/samen_core/lib/samen/ai/analytics.ex
@@ -85,7 +85,7 @@
   @spec ask(term(), module(), String.t(), keyword()) ::
           {:ok, Samen.AI.Completion.t()} | {:error, term()}
   def ask(scope, resource, question, opts \\ []) when is_atom(resource) and is_binary(question) do
-    read_opts = Keyword.take(opts, [:query, :k, :l])
+    read_opts = Keyword.take(opts, [:query, :k, :l]) ++ [suppress: false]
     verb = Keyword.get(opts, :verb, :analyze)
     verb_opts = Keyword.drop(opts, [:query, :k, :l, :verb])

