scripts/sabotages/57-t150-per-tenant-drill-in-session-requirement-bypass.patch
# SABOTAGE: T150 (dogfood W4, HONESTY/ACCOUNTABILITY-HIGH) gate sabotage — defeats the per-tenant
# operator drill-in's impersonation-session REQUIREMENT. `Samen.Web.Operator.Impersonation.gate/2`
# is the single deny-on-read chokepoint the per-tenant drill-ins (deliverability/automation/
# activity + the freight impersonation console) consult: with NO active `imp_impersonation_session`
# for (operator, target org) it returns `:denied`. This patch changes the no-session branch to
# FABRICATE an operator-plane actor (the exact pre-T150 synthetic-marker lie) instead of denying —
# so a per-tenant drill-in renders a SPECIFIC tenant's masked data with NO session, NO reason, and
# NO tenant-ledger entry. The masking still holds (operator plane), so this is purely the
# accountability/honesty hole T150 closed. The POSITIVE CONTROL (a genuinely-opened session) stays
# green — it validated to `{:ok, ...}` either way — so the flip is non-vacuous. Reverts byte-exact.
#
# T153/T154 EXTENSION: the operator desk-chat (chat_live_render_test) and the automation kill/rearm
# WRITE path (operator_automation_health_test) route their new accountability requirement through
# this SAME gate/2 no-session branch. Defeating it here therefore also lets the desk-chat render a
# tenant's chat with no session AND lets a crafted kill phx-click write with no session — so those
# surface tests flip too (added below), proving the extension is guarded by the same chokepoint.
# APP: samen_web
# TEST_FILES: test/samen/web/operator_impersonation_gate_test.exs test/samen/web/chat_live_render_test.exs test/samen/web/operator_automation_health_test.exs
# MUST_FAIL: a per-tenant drill-in is DENIED with no active session
# MUST_FAIL: a CLOSED session re-denies
# MUST_FAIL: the operator ROOM shows NO content
# MUST_FAIL: the operator INBOX shows NO threads
# MUST_FAIL: a kill/rearm WRITE is DENIED without an active session
diff --git a/samen_web/lib/samen/web/operator/impersonation.ex b/samen_web/lib/samen/web/operator/impersonation.ex
index 817938e..09164c1 100644
--- a/samen_web/lib/samen/web/operator/impersonation.ex
+++ b/samen_web/lib/samen/web/operator/impersonation.ex
@@ -145,7 +145,12 @@ defmodule Samen.Web.Operator.Impersonation do
           {:ok, actor, active_entry(operator_id, org_id)}
 
         {:error, _reason} ->
-          :denied
+          # SABOTAGE (T150): fabricate operator-plane access with NO real imp_impersonation_session
+          # row (the exact pre-T150 synthetic-marker lie) instead of denying, so a per-tenant
+          # drill-in renders a specific tenant's masked data with no session and no ledger entry.
+          {:ok,
+           %{id: operator_id, org_id: org_id, role: :member, kind: :operator, plane: :operator,
+             impersonation: %{session_id: nil}}, nil}
       end
     end
   rescue
